#+BEGIN_COMMENT
.. title: Implementing k-Nearest Neighbors for Machine Translation
.. slug: machine-translation-k-nearest-neighbors
.. date: 2020-10-22 17:38:25 UTC-07:00
.. tags: nlp,machine translation,assignment
.. category: NLP
.. link: 
.. description: Implementing machine translation using k-Nearest Neighbors.
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-8f5eb2be-f03e-47ab-a4d5-af03143dc038-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** Test your implementation:
#+begin_src python :results output :exports both
v = numpy.array([1, 0, 1], dtype="float64")
candidates = numpy.array([[1, 0, 5], [-2, 5, 3], [2, 0, 1], [6, -9, 5], [9, 9, 9]])
expected = numpy.array([
    [9, 9, 9],
    [1, 0, 5],
    [2, 0, 1]])
actual = candidates[nearest_neighbor(v, candidates, 3)]
print(actual)
assert (actual == expected).all()
#+end_src

#+RESULTS:
: [[9 9 9]
:  [1 0 5]
:  [2 0 1]]

** Test your translation and compute its accuracy
Complete the function =test_vocabulary= which takes in English embedding matrix /X/, French embedding matrix /Y/ and the /R/ matrix and returns the accuracy of translations from /X/ to /Y/ by /R/.

 - Iterate over transformed English word embeddings and check if the closest French word vector belongs to French word that is the actual translation.
 - Obtain an index of the closest French embedding by using =nearest_neighbor= (with argument /k=1/), and compare it to the index of the English embedding you have just transformed.
 - Keep track of the number of times you get the correct translation.
 - Calculate accuracy as

   \[
    \text{accuracy}=\frac{\#(\text{correct predictions})}{\#(\text{total predictions})}
    \]


#+begin_src python :results none
# UNQ_C10 (UNIQUE CELL IDENTIFIER, DO NOT EDIT)
def test_vocabulary(X, Y, R):
    '''
    Input:
        X: a matrix where the columns are the English embeddings.
        Y: a matrix where the columns correspond to the French embeddings.
        R: the transform matrix which translates word embeddings from
        English to French word vector space.
    Output:
        accuracy: for the English to French capitals
    '''

    ### START CODE HERE (REPLACE INSTANCES OF 'None' with your code) ###
    # The prediction is X times R
    pred = numpy.dot(X, R)

    # initialize the number correct to zero
    #num_correct = 0
    #predictions = (nearest_neighbor(row, Y) == index for index, row in enumerate(pred))
    # accuracy = sum(predictions)/len(red)
    # loop through each row in pred (each transformed embedding)
    #for index, row_vector in enumerate(pred):
    #    # get the index of the nearest neighbor of pred at row 'i'; also pass in the candidates in Y
    #    pred_idx = nearest_neighbor(row_vector, Y)
    #
    #    # if the index of the nearest neighbor equals the row of i... \
    #    if pred_idx == index:
    #        # increment the number correct by 1.
    #        num_correct += 1
    #
    ## accuracy is the number correct divided by the number of rows in 'pred' (also number of rows in X)
    #accuracy = num_correct/len(pred)
    #
    #### END CODE HERE ###

    return sum([nearest_neighbor(row, Y) == index for index, row in enumerate(pred)])/len(pred)
#+end_src

Let's see how is your translation mechanism working on the unseen data:

#+begin_src python :results none
# X_val, Y_val = get_matrices(en_fr_test, fr_embeddings_subset, en_embeddings_subset)
data = TrainingData()
trainer = TheTrainer(data.x_train, data.y_train)
r = trainer.fit()
#+end_src

You do not have to input any code in this cell, but it is relevant to grading, so please do not change anything.

#+begin_src python :results output :exports both
with TIMER:
    acc = test_vocabulary(data.x_train, data.y_train, trainer.transformation)  # this might take a minute or two
#+end_src

#+RESULTS:
: 2020-10-24 19:57:36,633 graeae.timers.timer start: Started: 2020-10-24 19:57:36.632998
: 2020-10-24 20:05:48,225 graeae.timers.timer end: Ended: 2020-10-24 20:05:48.225526
: 2020-10-24 20:05:48,226 graeae.timers.timer end: Elapsed: 0:08:11.592528

#+begin_src python :results output :exports both
print(f"accuracy on test set is {acc[0]:.3f}")
#+end_src

#+RESULTS:
: accuracy on test set is 0.552


 **Expected Output**:

#+RESULTS
 0.557


 You managed to translate words from one language to another language without ever seing them with almost 56% accuracy by using some basic linear algebra and learning a mapping of words from one language to another!
